EG0xy/ArduinoProject/Arduino_IDE_Hack/hardware/attiny13/avr/boards.txt
menu.cpu=CPU

###############################################################

attiny13a.name=〖Juno Tiny13〗
attiny13a.build.board=attiny13

###############################################################

attiny13a.menu.cpu.9_6mhz=【Attiny13 - 9.6Mhz】
attiny13a.menu.cpu.9_6mhz.upload.using=arduino:arduinoisp
attiny13a.menu.cpu.9_6mhz.upload.maximum_size=1024
attiny13a.menu.cpu.9_6mhz.upload.speed=19200
attiny13a.menu.cpu.9_6mhz.maximum_data_size=64
attiny13a.menu.cpu.9_6mhz.bootloader.low_fuses=0x7A
attiny13a.menu.cpu.9_6mhz.bootloader.high_fuses=0xFF
attiny13a.menu.cpu.9_6mhz.bootloader.path=empty
attiny13a.menu.cpu.9_6mhz.bootloader.file=empty
attiny13a.menu.cpu.9_6mhz.bootloader.unlock_bits=0xFF
attiny13a.menu.cpu.9_6mhz.bootloader.lock_bits=0xFF
attiny13a.menu.cpu.9_6mhz.build.mcu=attiny13
attiny13a.menu.cpu.9_6mhz.upload.tool=avrdude
attiny13a.menu.cpu.9_6mhz.build.f_cpu=9600000L
attiny13a.menu.cpu.9_6mhz.build.core=core13

###############################################################

attiny13a.menu.cpu.4_8mhz=【Attiny13 - 4.8Mhz】
attiny13a.menu.cpu.4_8mhz.upload.using=arduino:arduinoisp
attiny13a.menu.cpu.4_8mhz.upload.maximum_size=1024
attiny13a.menu.cpu.4_8mhz.maximum_data_size=64
attiny13a.menu.cpu.4_8mhz.upload.speed=19200
attiny13a.menu.cpu.4_8mhz.bootloader.low_fuses=0x79
attiny13a.menu.cpu.4_8mhz.bootloader.high_fuses=0xFF
attiny13a.menu.cpu.4_8mhz.bootloader.path=empty
attiny13a.menu.cpu.4_8mhz.bootloader.file=empty
attiny13a.menu.cpu.4_8mhz.bootloader.unlock_bits=0xFF
attiny13a.menu.cpu.4_8mhz.bootloader.lock_bits=0xFF
attiny13a.menu.cpu.4_8mhz.build.mcu=attiny13
attiny13a.menu.cpu.4_8mhz.upload.tool=avrdude
attiny13a.menu.cpu.4_8mhz.build.f_cpu=4800000L
attiny13a.menu.cpu.4_8mhz.build.core=core13

###############################################################

attiny13a.menu.cpu.1_2mhz=【Attiny13 - 1.2Mhz】
attiny13a.menu.cpu.1_2mhz.upload.using=arduino:arduinoisp
attiny13a.menu.cpu.1_2mhz.upload.maximum_size=1024
attiny13a.menu.cpu.1_2mhz.maximum_data_size=64
attiny13a.menu.cpu.1_2mhz.upload.speed=19200
attiny13a.menu.cpu.1_2mhz.bootloader.low_fuses=0x6a
attiny13a.menu.cpu.1_2mhz.bootloader.high_fuses=0xFF
attiny13a.menu.cpu.1_2mhz.bootloader.path=empty
attiny13a.menu.cpu.1_2mhz.bootloader.file=empty
attiny13a.menu.cpu.1_2mhz.bootloader.unlock_bits=0xFF
attiny13a.menu.cpu.1_2mhz.bootloader.lock_bits=0xFF
attiny13a.menu.cpu.1_2mhz.build.mcu=attiny13
attiny13a.menu.cpu.1_2mhz.upload.tool=avrdude
attiny13a.menu.cpu.1_2mhz.build.f_cpu=1200000L
attiny13a.menu.cpu.1_2mhz.build.core=core13
###############################################################

attiny13a.menu.cpu.600khz=【Attiny13 - 600Khz】
attiny13a.menu.cpu.600khz.upload.using=arduino:arduinoisp
attiny13a.menu.cpu.600khz.upload.maximum_size=1024
attiny13a.menu.cpu.600khz.maximum_data_size=64
attiny13a.menu.cpu.600khz.upload.speed=19200
attiny13a.menu.cpu.600khz.bootloader.low_fuses=0x69
attiny13a.menu.cpu.600khz.bootloader.high_fuses=0xFF
attiny13a.menu.cpu.600khz.bootloader.path=empty
attiny13a.menu.cpu.600khz.bootloader.file=empty
attiny13a.menu.cpu.600khz.bootloader.unlock_bits=0xFF
attiny13a.menu.cpu.600khz.bootloader.lock_bits=0xFF
attiny13a.menu.cpu.600khz.build.mcu=attiny13
attiny13a.menu.cpu.600khz.upload.tool=avrdude
attiny13a.menu.cpu.600khz.build.f_cpu=600000L
attiny13a.menu.cpu.600khz.build.core=core13
###############################################################

attiny13a.menu.cpu.128khz=【Attiny13 - 128Khz】
attiny13a.menu.cpu.128khz.upload.using=arduino:arduinoisp
attiny13a.menu.cpu.128khz.upload.maximum_size=1024
attiny13a.menu.cpu.128khz.maximum_data_size=64
attiny13a.menu.cpu.128khz.upload.speed=19200
attiny13a.menu.cpu.128khz.bootloader.low_fuses=0x7b
attiny13a.menu.cpu.128khz.bootloader.high_fuses=0xFF
attiny13a.menu.cpu.128khz.bootloader.path=empty
attiny13a.menu.cpu.128khz.bootloader.file=empty
attiny13a.menu.cpu.128khz.bootloader.unlock_bits=0xFF
attiny13a.menu.cpu.128khz.bootloader.lock_bits=0xFF
attiny13a.menu.cpu.128khz.build.mcu=attiny13
attiny13a.menu.cpu.128khz.upload.tool=avrdude
attiny13a.menu.cpu.128khz.build.f_cpu=128000L
attiny13a.menu.cpu.128khz.build.core=core13

###############################################################

